Model: "DSConvModelMedium21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 80, 126, 1)]      0         
_________________________________________________________________
conv2d (Conv2D)              (None, 80, 63, 172)       7052      
_________________________________________________________________
batch_normalization (BatchNo (None, 80, 63, 172)       688       
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 39, 31, 172)       1720      
_________________________________________________________________
batch_normalization_1 (Batch (None, 39, 31, 172)       688       
_________________________________________________________________
activation (Activation)      (None, 39, 31, 172)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 39, 31, 172)       29756     
_________________________________________________________________
batch_normalization_2 (Batch (None, 39, 31, 172)       688       
_________________________________________________________________
activation_1 (Activation)    (None, 39, 31, 172)       0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 37, 29, 172)       1720      
_________________________________________________________________
batch_normalization_3 (Batch (None, 37, 29, 172)       688       
_________________________________________________________________
activation_2 (Activation)    (None, 37, 29, 172)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 37, 29, 172)       29756     
_________________________________________________________________
batch_normalization_4 (Batch (None, 37, 29, 172)       688       
_________________________________________________________________
activation_3 (Activation)    (None, 37, 29, 172)       0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 35, 27, 172)       1720      
_________________________________________________________________
batch_normalization_5 (Batch (None, 35, 27, 172)       688       
_________________________________________________________________
activation_4 (Activation)    (None, 35, 27, 172)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 35, 27, 172)       29756     
_________________________________________________________________
batch_normalization_6 (Batch (None, 35, 27, 172)       688       
_________________________________________________________________
activation_5 (Activation)    (None, 35, 27, 172)       0         
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 33, 25, 172)       1720      
_________________________________________________________________
batch_normalization_7 (Batch (None, 33, 25, 172)       688       
_________________________________________________________________
activation_6 (Activation)    (None, 33, 25, 172)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 33, 25, 172)       29756     
_________________________________________________________________
batch_normalization_8 (Batch (None, 33, 25, 172)       688       
_________________________________________________________________
activation_7 (Activation)    (None, 33, 25, 172)       0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 16, 12, 172)       0         
_________________________________________________________________
flatten (Flatten)            (None, 33024)             0         
_________________________________________________________________
dense (Dense)                (None, 21)                693525    
=================================================================
Total params: 832,673
Trainable params: 829,577
Non-trainable params: 3,096
_________________________________________________________________

Train loss:	0.02
Train accuracy:	0.994
Val loss:	0.453
Val accuracy:	0.927
Test loss:	0.293
Test accuracy:	0.927
Bias:		0.006
Variance:	0.067
Precision:	0.927
Recall:		0.927
F1:		0.927

Most 20 mispredicted words
60	three-unknown
53	four-unknown
34	two-unknown
33	left-unknown
32	go-unknown
32	no-unknown
29	one-unknown
28	down-unknown
28	up-unknown
26	up-off
25	eight-unknown
25	right-unknown
23	five-unknown
21	off-unknown
20	no-go
19	on-unknown
16	no-down
15	nine-unknown
14	zero-unknown
14	stop-unknown
