Model: "DSConvModelSmall21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 40, 126, 1)]      0         
_________________________________________________________________
conv2d (Conv2D)              (None, 20, 63, 64)        2624      
_________________________________________________________________
batch_normalization (BatchNo (None, 20, 63, 64)        256       
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 18, 61, 64)        640       
_________________________________________________________________
batch_normalization_1 (Batch (None, 18, 61, 64)        256       
_________________________________________________________________
activation (Activation)      (None, 18, 61, 64)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 18, 61, 64)        4160      
_________________________________________________________________
batch_normalization_2 (Batch (None, 18, 61, 64)        256       
_________________________________________________________________
activation_1 (Activation)    (None, 18, 61, 64)        0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 16, 59, 64)        640       
_________________________________________________________________
batch_normalization_3 (Batch (None, 16, 59, 64)        256       
_________________________________________________________________
activation_2 (Activation)    (None, 16, 59, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 16, 59, 64)        4160      
_________________________________________________________________
batch_normalization_4 (Batch (None, 16, 59, 64)        256       
_________________________________________________________________
activation_3 (Activation)    (None, 16, 59, 64)        0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 14, 57, 64)        640       
_________________________________________________________________
batch_normalization_5 (Batch (None, 14, 57, 64)        256       
_________________________________________________________________
activation_4 (Activation)    (None, 14, 57, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 57, 64)        4160      
_________________________________________________________________
batch_normalization_6 (Batch (None, 14, 57, 64)        256       
_________________________________________________________________
activation_5 (Activation)    (None, 14, 57, 64)        0         
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 12, 55, 64)        640       
_________________________________________________________________
batch_normalization_7 (Batch (None, 12, 55, 64)        256       
_________________________________________________________________
activation_6 (Activation)    (None, 12, 55, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 12, 55, 64)        4160      
_________________________________________________________________
batch_normalization_8 (Batch (None, 12, 55, 64)        256       
_________________________________________________________________
activation_7 (Activation)    (None, 12, 55, 64)        0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 6, 27, 64)         0         
_________________________________________________________________
flatten (Flatten)            (None, 10368)             0         
_________________________________________________________________
dense (Dense)                (None, 21)                217749    
=================================================================
Total params: 241,877
Trainable params: 240,725
Non-trainable params: 1,152
_________________________________________________________________

Train loss:	0.018
Train accuracy:	0.994
Val loss:	0.728
Val accuracy:	0.894
Test loss:	0.658
Test accuracy:	0.892
Bias:		0.006
Variance:	0.101
Precision:	0.892
Recall:		0.892
F1:		0.892

Most 20 mispredicted words
114	for-unknown
64	three-unknown
52	go-unknown
48	down-unknown
41	nine-unknown
41	one-unknown
41	left-unknown
38	five-unknown
38	up-unknown
36	eight-unknown
36	off-unknown
34	no-unknown
33	zero-unknown
30	two-unknown
28	stop-unknown
28	up-off
24	no-go
21	on-unknown
21	right-unknown
21	yes-unknown
