Model: "DSConvModel21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 40, 126, 1)]      0         
_________________________________________________________________
conv2d (Conv2D)              (None, 40, 63, 276)       11316     
_________________________________________________________________
batch_normalization (BatchNo (None, 40, 63, 276)       1104      
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 19, 31, 276)       2760      
_________________________________________________________________
batch_normalization_1 (Batch (None, 19, 31, 276)       1104      
_________________________________________________________________
activation (Activation)      (None, 19, 31, 276)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 19, 31, 276)       76452     
_________________________________________________________________
batch_normalization_2 (Batch (None, 19, 31, 276)       1104      
_________________________________________________________________
activation_1 (Activation)    (None, 19, 31, 276)       0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 17, 29, 276)       2760      
_________________________________________________________________
batch_normalization_3 (Batch (None, 17, 29, 276)       1104      
_________________________________________________________________
activation_2 (Activation)    (None, 17, 29, 276)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 17, 29, 276)       76452     
_________________________________________________________________
batch_normalization_4 (Batch (None, 17, 29, 276)       1104      
_________________________________________________________________
activation_3 (Activation)    (None, 17, 29, 276)       0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 15, 27, 276)       2760      
_________________________________________________________________
batch_normalization_5 (Batch (None, 15, 27, 276)       1104      
_________________________________________________________________
activation_4 (Activation)    (None, 15, 27, 276)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 15, 27, 276)       76452     
_________________________________________________________________
batch_normalization_6 (Batch (None, 15, 27, 276)       1104      
_________________________________________________________________
activation_5 (Activation)    (None, 15, 27, 276)       0         
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 13, 25, 276)       2760      
_________________________________________________________________
batch_normalization_7 (Batch (None, 13, 25, 276)       1104      
_________________________________________________________________
activation_6 (Activation)    (None, 13, 25, 276)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 13, 25, 276)       76452     
_________________________________________________________________
batch_normalization_8 (Batch (None, 13, 25, 276)       1104      
_________________________________________________________________
activation_7 (Activation)    (None, 13, 25, 276)       0         
_________________________________________________________________
depthwise_conv2d_4 (Depthwis (None, 11, 23, 276)       2760      
_________________________________________________________________
batch_normalization_9 (Batch (None, 11, 23, 276)       1104      
_________________________________________________________________
activation_8 (Activation)    (None, 11, 23, 276)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 11, 23, 276)       76452     
_________________________________________________________________
batch_normalization_10 (Batc (None, 11, 23, 276)       1104      
_________________________________________________________________
activation_9 (Activation)    (None, 11, 23, 276)       0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 5, 11, 276)        0         
_________________________________________________________________
flatten (Flatten)            (None, 15180)             0         
_________________________________________________________________
dense (Dense)                (None, 21)                318801    
=================================================================
Total params: 738,321
Trainable params: 732,249
Non-trainable params: 6,072
_________________________________________________________________

Train loss:	0.031
Train accuracy:	0.99
Val loss:	0.315
Val accuracy:	0.938
Test loss:	0.222
Test accuracy:	0.937
Bias:		0.01
Variance:	0.052
Precision:	0.937
Recall:		0.937
F1:		0.937

Most 20 mispredicted words
59	four-unknown
50	three-unknown
46	down-unknown
33	go-unknown
27	one-unknown
23	up-unknown
22	no-unknown
20	eight-unknown
17	two-unknown
17	zero-unknown
16	nine-unknown
16	left-unknown
15	up-off
14	five-unknown
14	stop-unknown
14	no-nine
13	seven-unknown
13	off-unknown
12	on-unknown
12	right-unknown
