Model: "LeNet5-elu-1FC-Reg"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 120, 126, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 116, 122, 6)       156       
_________________________________________________________________
average_pooling2d (AveragePo (None, 58, 61, 6)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 54, 57, 16)        2416      
_________________________________________________________________
average_pooling2d_1 (Average (None, 27, 28, 16)        0         
_________________________________________________________________
flatten (Flatten)            (None, 12096)             0         
_________________________________________________________________
dense (Dense)                (None, 10)                120970    
=================================================================
Total params: 123,542
Trainable params: 123,542
Non-trainable params: 0
_________________________________________________________________

Train loss:	0.091
Train accuracy:	0.988
Val loss:	2.892
Val accuracy:	0.676
Test loss:	1.681
Test accuracy:	0.691
Bias:		0.002
Variance:	0.312
Precision:	0.691
Recall:		0.691
F1:		0.691