Model: "DSConvModelMedium10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 120, 126, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 120, 63, 172)      7052      
_________________________________________________________________
batch_normalization (BatchNo (None, 120, 63, 172)      688       
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 59, 31, 172)       1720      
_________________________________________________________________
batch_normalization_1 (Batch (None, 59, 31, 172)       688       
_________________________________________________________________
activation (Activation)      (None, 59, 31, 172)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 59, 31, 172)       29756     
_________________________________________________________________
batch_normalization_2 (Batch (None, 59, 31, 172)       688       
_________________________________________________________________
activation_1 (Activation)    (None, 59, 31, 172)       0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 57, 29, 172)       1720      
_________________________________________________________________
batch_normalization_3 (Batch (None, 57, 29, 172)       688       
_________________________________________________________________
activation_2 (Activation)    (None, 57, 29, 172)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 57, 29, 172)       29756     
_________________________________________________________________
batch_normalization_4 (Batch (None, 57, 29, 172)       688       
_________________________________________________________________
activation_3 (Activation)    (None, 57, 29, 172)       0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 55, 27, 172)       1720      
_________________________________________________________________
batch_normalization_5 (Batch (None, 55, 27, 172)       688       
_________________________________________________________________
activation_4 (Activation)    (None, 55, 27, 172)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 55, 27, 172)       29756     
_________________________________________________________________
batch_normalization_6 (Batch (None, 55, 27, 172)       688       
_________________________________________________________________
activation_5 (Activation)    (None, 55, 27, 172)       0         
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 53, 25, 172)       1720      
_________________________________________________________________
batch_normalization_7 (Batch (None, 53, 25, 172)       688       
_________________________________________________________________
activation_6 (Activation)    (None, 53, 25, 172)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 53, 25, 172)       29756     
_________________________________________________________________
batch_normalization_8 (Batch (None, 53, 25, 172)       688       
_________________________________________________________________
activation_7 (Activation)    (None, 53, 25, 172)       0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 26, 12, 172)       0         
_________________________________________________________________
flatten (Flatten)            (None, 53664)             0         
_________________________________________________________________
dense (Dense)                (None, 10)                536650    
=================================================================
Total params: 675,798
Trainable params: 672,702
Non-trainable params: 3,096
_________________________________________________________________

Train loss:	0.02
Train accuracy:	0.994
Val loss:	0.338
Val accuracy:	0.927
Test loss:	0.281
Test accuracy:	0.948
Bias:		0.006
Variance:	0.067
Precision:	0.948
Recall:		0.948
F1:		0.948

Most 20 mispredicted words
24	no-go
16	up-off
13	no-down
12	on-off
9	up-on
8	yes-left
7	up-go
6	down-go
5	on-go
5	no-left
4	off-go
4	up-stop
4	no-off
3	right-go
3	right-on
3	down-stop
3	down-on
2	stop-go
2	off-stop
2	on-stop
