Model: "DSConvModelSmall"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 40, 126, 1)]      0         
_________________________________________________________________
conv2d (Conv2D)              (None, 20, 63, 64)        2624      
_________________________________________________________________
batch_normalization (BatchNo (None, 20, 63, 64)        256       
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 18, 61, 64)        640       
_________________________________________________________________
batch_normalization_1 (Batch (None, 18, 61, 64)        256       
_________________________________________________________________
activation (Activation)      (None, 18, 61, 64)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 18, 61, 64)        4160      
_________________________________________________________________
batch_normalization_2 (Batch (None, 18, 61, 64)        256       
_________________________________________________________________
activation_1 (Activation)    (None, 18, 61, 64)        0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 16, 59, 64)        640       
_________________________________________________________________
batch_normalization_3 (Batch (None, 16, 59, 64)        256       
_________________________________________________________________
activation_2 (Activation)    (None, 16, 59, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 16, 59, 64)        4160      
_________________________________________________________________
batch_normalization_4 (Batch (None, 16, 59, 64)        256       
_________________________________________________________________
activation_3 (Activation)    (None, 16, 59, 64)        0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 14, 57, 64)        640       
_________________________________________________________________
batch_normalization_5 (Batch (None, 14, 57, 64)        256       
_________________________________________________________________
activation_4 (Activation)    (None, 14, 57, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 57, 64)        4160      
_________________________________________________________________
batch_normalization_6 (Batch (None, 14, 57, 64)        256       
_________________________________________________________________
activation_5 (Activation)    (None, 14, 57, 64)        0         
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 12, 55, 64)        640       
_________________________________________________________________
batch_normalization_7 (Batch (None, 12, 55, 64)        256       
_________________________________________________________________
activation_6 (Activation)    (None, 12, 55, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 12, 55, 64)        4160      
_________________________________________________________________
batch_normalization_8 (Batch (None, 12, 55, 64)        256       
_________________________________________________________________
activation_7 (Activation)    (None, 12, 55, 64)        0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 6, 27, 64)         0         
_________________________________________________________________
flatten (Flatten)            (None, 10368)             0         
_________________________________________________________________
dense (Dense)                (None, 21)                217749    
=================================================================
Total params: 241,877
Trainable params: 240,725
Non-trainable params: 1,152
_________________________________________________________________

Train loss:	0.0
Train accuracy:	1.0
Val loss:	2.895
Val accuracy:	0.436
Test loss:	2.61
Test accuracy:	0.441
Bias:		0.0
Variance:	0.564
Precision:	0.441
Recall:		0.441
F1:		0.441