Model: "LeNet5-elu-2FC-Reg"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 120, 126, 1) 0                                            
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 120, 126, 10) 260         input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 120, 126, 10) 40          conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 120, 126, 1)  251         batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 120, 126, 1)  4           conv2d_3[0][0]                   
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 120, 126)     0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, 120, 128)     97792       squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 120, 128)     98816       bidirectional[0][0]              
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 128)          0           bidirectional_1[0][0]            
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 128)          16512       lambda[0][0]                     
__________________________________________________________________________________________________
dot (Dot)                       (None, 120)          0           dense_2[0][0]                    
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
attSoftmax (Softmax)            (None, 120)          0           dot[0][0]                        
__________________________________________________________________________________________________
dot_1 (Dot)                     (None, 128)          0           attSoftmax[0][0]                 
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 64)           8256        dot_1[0][0]                      
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 32)           2080        dense_3[0][0]                    
__________________________________________________________________________________________________
output (Dense)                  (None, 10)           330         dense_4[0][0]                    
==================================================================================================
Total params: 224,341
Trainable params: 224,319
Non-trainable params: 22
__________________________________________________________________________________________________

Train loss:	0.004
Train accuracy:	1.0
Val loss:	4.402
Val accuracy:	0.19
Test loss:	3.953
Test accuracy:	0.145
Bias:		-0.01
Variance:	0.81
Precision:	0.145
Recall:		0.145
F1:		0.145