Model: "LeNet5-elu-2FC-Reg"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 120, 126, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 116, 122, 6)       156       
_________________________________________________________________
average_pooling2d (AveragePo (None, 58, 61, 6)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 54, 57, 16)        2416      
_________________________________________________________________
average_pooling2d_1 (Average (None, 27, 28, 16)        0         
_________________________________________________________________
flatten (Flatten)            (None, 12096)             0         
_________________________________________________________________
dense (Dense)                (None, 120)               1451640   
_________________________________________________________________
dense_1 (Dense)              (None, 10)                1210      
=================================================================
Total params: 1,455,422
Trainable params: 1,455,422
Non-trainable params: 0
_________________________________________________________________

Train loss:	0.114
Train accuracy:	0.993
Val loss:	1.016
Val accuracy:	0.77
Test loss:	0.84
Test accuracy:	0.796
Bias:		-0.003
Variance:	0.223
Precision:	0.796
Recall:		0.796
F1:		0.796