Model: "DSConvModelMedium21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 120, 126, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 120, 63, 172)      7052      
_________________________________________________________________
batch_normalization (BatchNo (None, 120, 63, 172)      688       
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 59, 31, 172)       1720      
_________________________________________________________________
batch_normalization_1 (Batch (None, 59, 31, 172)       688       
_________________________________________________________________
activation (Activation)      (None, 59, 31, 172)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 59, 31, 172)       29756     
_________________________________________________________________
batch_normalization_2 (Batch (None, 59, 31, 172)       688       
_________________________________________________________________
activation_1 (Activation)    (None, 59, 31, 172)       0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 57, 29, 172)       1720      
_________________________________________________________________
batch_normalization_3 (Batch (None, 57, 29, 172)       688       
_________________________________________________________________
activation_2 (Activation)    (None, 57, 29, 172)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 57, 29, 172)       29756     
_________________________________________________________________
batch_normalization_4 (Batch (None, 57, 29, 172)       688       
_________________________________________________________________
activation_3 (Activation)    (None, 57, 29, 172)       0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 55, 27, 172)       1720      
_________________________________________________________________
batch_normalization_5 (Batch (None, 55, 27, 172)       688       
_________________________________________________________________
activation_4 (Activation)    (None, 55, 27, 172)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 55, 27, 172)       29756     
_________________________________________________________________
batch_normalization_6 (Batch (None, 55, 27, 172)       688       
_________________________________________________________________
activation_5 (Activation)    (None, 55, 27, 172)       0         
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 53, 25, 172)       1720      
_________________________________________________________________
batch_normalization_7 (Batch (None, 53, 25, 172)       688       
_________________________________________________________________
activation_6 (Activation)    (None, 53, 25, 172)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 53, 25, 172)       29756     
_________________________________________________________________
batch_normalization_8 (Batch (None, 53, 25, 172)       688       
_________________________________________________________________
activation_7 (Activation)    (None, 53, 25, 172)       0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 26, 12, 172)       0         
_________________________________________________________________
flatten (Flatten)            (None, 53664)             0         
_________________________________________________________________
dense (Dense)                (None, 21)                1126965   
=================================================================
Total params: 1,266,113
Trainable params: 1,263,017
Non-trainable params: 3,096
_________________________________________________________________

Train loss:	0.023
Train accuracy:	0.993
Val loss:	0.412
Val accuracy:	0.927
Test loss:	0.342
Test accuracy:	0.917
Bias:		0.007
Variance:	0.066
Precision:	0.917
Recall:		0.917
F1:		0.917

Most 20 mispredicted words
82	four-unknown
64	down-unknown
56	three-unknown
36	go-unknown
29	left-unknown
29	no-unknown
27	right-unknown
26	eight-unknown
26	one-unknown
25	no-down
23	two-unknown
22	zero-unknown
22	no-go
21	up-unknown
20	nine-unknown
20	five-unknown
20	up-off
18	down-go
16	no-nine
16	yes-unknown
