Model: "DirectCNN"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 16000, 1)]        0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 7969, 16)          1040      
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 996, 16)           0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 483, 32)           16416     
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 60, 32)            0         
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 23, 64)            32832     
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 8, 128)            65664     
_________________________________________________________________
flatten_1 (Flatten)          (None, 1024)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 128)               131200    
_________________________________________________________________
dense_4 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_5 (Dense)              (None, 10)                650       
=================================================================
Total params: 256,058
Trainable params: 256,058
Non-trainable params: 0
_________________________________________________________________

Train loss:	0.05
Train accuracy:	0.987
Val loss:	0.753
Val accuracy:	0.905
Test loss:	0.532
Test accuracy:	0.917
Bias:		0.013
Variance:	0.081
Precision:	0.917
Recall:		0.917
F1:		0.917