Model: "DirectCNN"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 16000, 1)]        0         
_________________________________________________________________
conv1d (Conv1D)              (None, 7969, 16)          1040      
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 996, 16)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 483, 32)           16416     
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 60, 32)            0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 23, 64)            32832     
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 8, 128)            65664     
_________________________________________________________________
flatten (Flatten)            (None, 1024)              0         
_________________________________________________________________
dense (Dense)                (None, 128)               131200    
_________________________________________________________________
dense_1 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_2 (Dense)              (None, 10)                650       
=================================================================
Total params: 256,058
Trainable params: 256,058
Non-trainable params: 0
_________________________________________________________________

Train loss:	0.051
Train accuracy:	0.985
Val loss:	0.673
Val accuracy:	0.899
Test loss:	0.463
Test accuracy:	0.912
Bias:		0.015
Variance:	0.086
Precision:	0.912
Recall:		0.912
F1:		0.912