Model: "DSConvModelSmall21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 120, 126, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 60, 63, 64)        2624      
_________________________________________________________________
batch_normalization (BatchNo (None, 60, 63, 64)        256       
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 58, 61, 64)        640       
_________________________________________________________________
batch_normalization_1 (Batch (None, 58, 61, 64)        256       
_________________________________________________________________
activation (Activation)      (None, 58, 61, 64)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 58, 61, 64)        4160      
_________________________________________________________________
batch_normalization_2 (Batch (None, 58, 61, 64)        256       
_________________________________________________________________
activation_1 (Activation)    (None, 58, 61, 64)        0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 56, 59, 64)        640       
_________________________________________________________________
batch_normalization_3 (Batch (None, 56, 59, 64)        256       
_________________________________________________________________
activation_2 (Activation)    (None, 56, 59, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 59, 64)        4160      
_________________________________________________________________
batch_normalization_4 (Batch (None, 56, 59, 64)        256       
_________________________________________________________________
activation_3 (Activation)    (None, 56, 59, 64)        0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 54, 57, 64)        640       
_________________________________________________________________
batch_normalization_5 (Batch (None, 54, 57, 64)        256       
_________________________________________________________________
activation_4 (Activation)    (None, 54, 57, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 54, 57, 64)        4160      
_________________________________________________________________
batch_normalization_6 (Batch (None, 54, 57, 64)        256       
_________________________________________________________________
activation_5 (Activation)    (None, 54, 57, 64)        0         
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 52, 55, 64)        640       
_________________________________________________________________
batch_normalization_7 (Batch (None, 52, 55, 64)        256       
_________________________________________________________________
activation_6 (Activation)    (None, 52, 55, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 52, 55, 64)        4160      
_________________________________________________________________
batch_normalization_8 (Batch (None, 52, 55, 64)        256       
_________________________________________________________________
activation_7 (Activation)    (None, 52, 55, 64)        0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 26, 27, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 44928)             0         
_________________________________________________________________
dense (Dense)                (None, 21)                943509    
=================================================================
Total params: 967,637
Trainable params: 966,485
Non-trainable params: 1,152
_________________________________________________________________

Train loss:	0.02
Train accuracy:	0.994
Val loss:	1.101
Val accuracy:	0.839
Test loss:	0.737
Test accuracy:	0.865
Bias:		0.006
Variance:	0.155
Precision:	0.865
Recall:		0.865
F1:		0.865

Most 20 mispredicted words
130	four-unknown
78	three-unknown
67	left-unknown
65	no-unknown
63	go-unknown
52	down-unknown
49	one-unknown
44	up-unknown
41	two-unknown
40	five-unknown
40	on-unknown
39	off-unknown
36	zero-unknown
35	no-go
34	nine-unknown
33	up-off
29	eight-unknown
28	right-unknown
28	no-down
27	seven-unknown
