Model: "AttRNNSpeechModel"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            [(None, 36, 126, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 36, 126, 10)  260         input_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 36, 126, 10)  40          conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 36, 126, 1)   251         batch_normalization_2[0][0]      
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 36, 126, 1)   4           conv2d_7[0][0]                   
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 36, 126)      0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 36, 128)      97792       squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
bidirectional_3 (Bidirectional) (None, 36, 128)      98816       bidirectional_2[0][0]            
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 128)          0           bidirectional_3[0][0]            
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 128)          16512       lambda_1[0][0]                   
__________________________________________________________________________________________________
dot_2 (Dot)                     (None, 36)           0           dense_7[0][0]                    
                                                                 bidirectional_3[0][0]            
__________________________________________________________________________________________________
attSoftmax (Softmax)            (None, 36)           0           dot_2[0][0]                      
__________________________________________________________________________________________________
dot_3 (Dot)                     (None, 128)          0           attSoftmax[0][0]                 
                                                                 bidirectional_3[0][0]            
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 64)           8256        dot_3[0][0]                      
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 32)           2080        dense_8[0][0]                    
__________________________________________________________________________________________________
output (Dense)                  (None, 10)           330         dense_9[0][0]                    
==================================================================================================
Total params: 224,341
Trainable params: 224,319
Non-trainable params: 22
__________________________________________________________________________________________________

Train loss:	0.0
Train accuracy:	1.0
Val loss:	2.065
Val accuracy:	0.727
Test loss:	1.785
Test accuracy:	0.742
Bias:		-0.01
Variance:	0.273
Precision:	0.742
Recall:		0.742
F1:		0.742