Model: "LeNet5-elu-1FC-BN"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 120, 126, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 116, 122, 6)       156       
_________________________________________________________________
batch_normalization (BatchNo (None, 116, 122, 6)       24        
_________________________________________________________________
average_pooling2d (AveragePo (None, 58, 61, 6)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 54, 57, 16)        2416      
_________________________________________________________________
batch_normalization_1 (Batch (None, 54, 57, 16)        64        
_________________________________________________________________
average_pooling2d_1 (Average (None, 27, 28, 16)        0         
_________________________________________________________________
flatten (Flatten)            (None, 12096)             0         
_________________________________________________________________
dense (Dense)                (None, 10)                120970    
=================================================================
Total params: 123,630
Trainable params: 123,586
Non-trainable params: 44
_________________________________________________________________

Train loss:	0.027
Train accuracy:	0.993
Val loss:	2.748
Val accuracy:	0.635
Test loss:	1.337
Test accuracy:	0.656
Bias:		-0.003
Variance:	0.358
Precision:	0.656
Recall:		0.656
F1:		0.656