Model: "AttRNNSpeechModel"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 80, 126, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 80, 126, 10)  260         input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 80, 126, 10)  40          conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 80, 126, 1)   251         batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 80, 126, 1)   4           conv2d_3[0][0]                   
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 80, 126)      0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, 80, 128)      97792       squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 80, 128)      98816       bidirectional[0][0]              
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 128)          0           bidirectional_1[0][0]            
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 128)          16512       lambda[0][0]                     
__________________________________________________________________________________________________
dot (Dot)                       (None, 80)           0           dense_2[0][0]                    
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
attSoftmax (Softmax)            (None, 80)           0           dot[0][0]                        
__________________________________________________________________________________________________
dot_1 (Dot)                     (None, 128)          0           attSoftmax[0][0]                 
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 64)           8256        dot_1[0][0]                      
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 32)           2080        dense_3[0][0]                    
__________________________________________________________________________________________________
output (Dense)                  (None, 10)           330         dense_4[0][0]                    
==================================================================================================
Total params: 224,341
Trainable params: 224,319
Non-trainable params: 22
__________________________________________________________________________________________________

Train loss:	0.002
Train accuracy:	1.0
Val loss:	1.633
Val accuracy:	0.749
Test loss:	1.338
Test accuracy:	0.755
Bias:		-0.01
Variance:	0.251
Precision:	0.755
Recall:		0.755
F1:		0.755