Model: "DSConvModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 40, 126, 1)]      0         
_________________________________________________________________
conv2d (Conv2D)              (None, 36, 122, 6)        156       
_________________________________________________________________
batch_normalization (BatchNo (None, 36, 122, 6)        24        
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 34, 120, 6)        60        
_________________________________________________________________
batch_normalization_1 (Batch (None, 34, 120, 6)        24        
_________________________________________________________________
activation (Activation)      (None, 34, 120, 6)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 34, 120, 6)        42        
_________________________________________________________________
batch_normalization_2 (Batch (None, 34, 120, 6)        24        
_________________________________________________________________
activation_1 (Activation)    (None, 34, 120, 6)        0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 32, 118, 6)        60        
_________________________________________________________________
batch_normalization_3 (Batch (None, 32, 118, 6)        24        
_________________________________________________________________
activation_2 (Activation)    (None, 32, 118, 6)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 118, 6)        42        
_________________________________________________________________
batch_normalization_4 (Batch (None, 32, 118, 6)        24        
_________________________________________________________________
activation_3 (Activation)    (None, 32, 118, 6)        0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 30, 116, 6)        60        
_________________________________________________________________
batch_normalization_5 (Batch (None, 30, 116, 6)        24        
_________________________________________________________________
activation_4 (Activation)    (None, 30, 116, 6)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 30, 116, 6)        42        
_________________________________________________________________
batch_normalization_6 (Batch (None, 30, 116, 6)        24        
_________________________________________________________________
activation_5 (Activation)    (None, 30, 116, 6)        0         
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 28, 114, 6)        60        
_________________________________________________________________
batch_normalization_7 (Batch (None, 28, 114, 6)        24        
_________________________________________________________________
activation_6 (Activation)    (None, 28, 114, 6)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 28, 114, 6)        42        
_________________________________________________________________
batch_normalization_8 (Batch (None, 28, 114, 6)        24        
_________________________________________________________________
activation_7 (Activation)    (None, 28, 114, 6)        0         
_________________________________________________________________
depthwise_conv2d_4 (Depthwis (None, 26, 112, 6)        60        
_________________________________________________________________
batch_normalization_9 (Batch (None, 26, 112, 6)        24        
_________________________________________________________________
activation_8 (Activation)    (None, 26, 112, 6)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 26, 112, 6)        42        
_________________________________________________________________
batch_normalization_10 (Batc (None, 26, 112, 6)        24        
_________________________________________________________________
activation_9 (Activation)    (None, 26, 112, 6)        0         
_________________________________________________________________
depthwise_conv2d_5 (Depthwis (None, 24, 110, 6)        60        
_________________________________________________________________
batch_normalization_11 (Batc (None, 24, 110, 6)        24        
_________________________________________________________________
activation_10 (Activation)   (None, 24, 110, 6)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 24, 110, 6)        42        
_________________________________________________________________
batch_normalization_12 (Batc (None, 24, 110, 6)        24        
_________________________________________________________________
activation_11 (Activation)   (None, 24, 110, 6)        0         
_________________________________________________________________
depthwise_conv2d_6 (Depthwis (None, 22, 108, 6)        60        
_________________________________________________________________
batch_normalization_13 (Batc (None, 22, 108, 6)        24        
_________________________________________________________________
activation_12 (Activation)   (None, 22, 108, 6)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 22, 108, 6)        42        
_________________________________________________________________
batch_normalization_14 (Batc (None, 22, 108, 6)        24        
_________________________________________________________________
activation_13 (Activation)   (None, 22, 108, 6)        0         
_________________________________________________________________
depthwise_conv2d_7 (Depthwis (None, 20, 106, 6)        60        
_________________________________________________________________
batch_normalization_15 (Batc (None, 20, 106, 6)        24        
_________________________________________________________________
activation_14 (Activation)   (None, 20, 106, 6)        0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 20, 106, 6)        42        
_________________________________________________________________
batch_normalization_16 (Batc (None, 20, 106, 6)        24        
_________________________________________________________________
activation_15 (Activation)   (None, 20, 106, 6)        0         
_________________________________________________________________
depthwise_conv2d_8 (Depthwis (None, 18, 104, 6)        60        
_________________________________________________________________
batch_normalization_17 (Batc (None, 18, 104, 6)        24        
_________________________________________________________________
activation_16 (Activation)   (None, 18, 104, 6)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 18, 104, 6)        42        
_________________________________________________________________
batch_normalization_18 (Batc (None, 18, 104, 6)        24        
_________________________________________________________________
activation_17 (Activation)   (None, 18, 104, 6)        0         
_________________________________________________________________
depthwise_conv2d_9 (Depthwis (None, 16, 102, 6)        60        
_________________________________________________________________
batch_normalization_19 (Batc (None, 16, 102, 6)        24        
_________________________________________________________________
activation_18 (Activation)   (None, 16, 102, 6)        0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 16, 102, 6)        42        
_________________________________________________________________
batch_normalization_20 (Batc (None, 16, 102, 6)        24        
_________________________________________________________________
activation_19 (Activation)   (None, 16, 102, 6)        0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 8, 51, 6)          0         
_________________________________________________________________
flatten (Flatten)            (None, 2448)              0         
_________________________________________________________________
dense (Dense)                (None, 10)                24490     
=================================================================
Total params: 26,170
Trainable params: 25,918
Non-trainable params: 252
_________________________________________________________________

Train loss:	0.256
Train accuracy:	0.935
Val loss:	5.786
Val accuracy:	0.122
Test loss:	2.531
Test accuracy:	0.141
Bias:		0.065
Variance:	0.813
Precision:	0.141
Recall:		0.141
F1:		0.141