Model: "DSConvModel21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 120, 126, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 120, 63, 276)      11316     
_________________________________________________________________
batch_normalization (BatchNo (None, 120, 63, 276)      1104      
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 59, 31, 276)       2760      
_________________________________________________________________
batch_normalization_1 (Batch (None, 59, 31, 276)       1104      
_________________________________________________________________
activation (Activation)      (None, 59, 31, 276)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 59, 31, 276)       76452     
_________________________________________________________________
batch_normalization_2 (Batch (None, 59, 31, 276)       1104      
_________________________________________________________________
activation_1 (Activation)    (None, 59, 31, 276)       0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 57, 29, 276)       2760      
_________________________________________________________________
batch_normalization_3 (Batch (None, 57, 29, 276)       1104      
_________________________________________________________________
activation_2 (Activation)    (None, 57, 29, 276)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 57, 29, 276)       76452     
_________________________________________________________________
batch_normalization_4 (Batch (None, 57, 29, 276)       1104      
_________________________________________________________________
activation_3 (Activation)    (None, 57, 29, 276)       0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 55, 27, 276)       2760      
_________________________________________________________________
batch_normalization_5 (Batch (None, 55, 27, 276)       1104      
_________________________________________________________________
activation_4 (Activation)    (None, 55, 27, 276)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 55, 27, 276)       76452     
_________________________________________________________________
batch_normalization_6 (Batch (None, 55, 27, 276)       1104      
_________________________________________________________________
activation_5 (Activation)    (None, 55, 27, 276)       0         
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 53, 25, 276)       2760      
_________________________________________________________________
batch_normalization_7 (Batch (None, 53, 25, 276)       1104      
_________________________________________________________________
activation_6 (Activation)    (None, 53, 25, 276)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 53, 25, 276)       76452     
_________________________________________________________________
batch_normalization_8 (Batch (None, 53, 25, 276)       1104      
_________________________________________________________________
activation_7 (Activation)    (None, 53, 25, 276)       0         
_________________________________________________________________
depthwise_conv2d_4 (Depthwis (None, 51, 23, 276)       2760      
_________________________________________________________________
batch_normalization_9 (Batch (None, 51, 23, 276)       1104      
_________________________________________________________________
activation_8 (Activation)    (None, 51, 23, 276)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 51, 23, 276)       76452     
_________________________________________________________________
batch_normalization_10 (Batc (None, 51, 23, 276)       1104      
_________________________________________________________________
activation_9 (Activation)    (None, 51, 23, 276)       0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 25, 11, 276)       0         
_________________________________________________________________
flatten (Flatten)            (None, 75900)             0         
_________________________________________________________________
dense (Dense)                (None, 21)                1593921   
=================================================================
Total params: 2,013,441
Trainable params: 2,007,369
Non-trainable params: 6,072
_________________________________________________________________

Train loss:	0.012
Train accuracy:	0.996
Val loss:	0.427
Val accuracy:	0.932
Test loss:	0.379
Test accuracy:	0.927
Bias:		0.004
Variance:	0.064
Precision:	0.927
Recall:		0.927
F1:		0.927

Most 20 mispredicted words
61	for-unknown
53	three-unknown
37	down-unknown
35	go-unknown
34	left-unknown
28	one-unknown
28	on-off
28	no-unknown
21	no-go
20	nine-unknown
20	eight-unknown
19	zero-unknown
19	up-off
18	two-unknown
18	up-unknown
18	no-down
14	five-unknown
13	on-unknown
13	right-unknown
13	yes-unknown
