Model: "DSConvModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 40, 126, 1)]      0         
_________________________________________________________________
conv2d (Conv2D)              (None, 16, 123, 276)      11316     
_________________________________________________________________
batch_normalization (BatchNo (None, 16, 123, 276)      1104      
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 7, 61, 276)        2760      
_________________________________________________________________
batch_normalization_1 (Batch (None, 7, 61, 276)        1104      
_________________________________________________________________
activation (Activation)      (None, 7, 61, 276)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 7, 61, 276)        76452     
_________________________________________________________________
batch_normalization_2 (Batch (None, 7, 61, 276)        1104      
_________________________________________________________________
activation_1 (Activation)    (None, 7, 61, 276)        0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 5, 59, 276)        2760      
_________________________________________________________________
batch_normalization_3 (Batch (None, 5, 59, 276)        1104      
_________________________________________________________________
activation_2 (Activation)    (None, 5, 59, 276)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 5, 59, 276)        76452     
_________________________________________________________________
batch_normalization_4 (Batch (None, 5, 59, 276)        1104      
_________________________________________________________________
activation_3 (Activation)    (None, 5, 59, 276)        0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 3, 57, 276)        2760      
_________________________________________________________________
batch_normalization_5 (Batch (None, 3, 57, 276)        1104      
_________________________________________________________________
activation_4 (Activation)    (None, 3, 57, 276)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 3, 57, 276)        76452     
_________________________________________________________________
batch_normalization_6 (Batch (None, 3, 57, 276)        1104      
_________________________________________________________________
activation_5 (Activation)    (None, 3, 57, 276)        0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 1, 28, 276)        0         
_________________________________________________________________
flatten (Flatten)            (None, 7728)              0         
_________________________________________________________________
dense (Dense)                (None, 10)                77290     
=================================================================
Total params: 333,970
Trainable params: 330,106
Non-trainable params: 3,864
_________________________________________________________________

Train loss:	0.0
Train accuracy:	1.0
Val loss:	1.108
Val accuracy:	0.787
Test loss:	1.136
Test accuracy:	0.784
Bias:		0.0
Variance:	0.213
Precision:	0.784
Recall:		0.784
F1:		0.784