Model: "DSConvModel10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 120, 126, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 120, 63, 276)      11316     
_________________________________________________________________
batch_normalization (BatchNo (None, 120, 63, 276)      1104      
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 59, 31, 276)       2760      
_________________________________________________________________
batch_normalization_1 (Batch (None, 59, 31, 276)       1104      
_________________________________________________________________
activation (Activation)      (None, 59, 31, 276)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 59, 31, 276)       76452     
_________________________________________________________________
batch_normalization_2 (Batch (None, 59, 31, 276)       1104      
_________________________________________________________________
activation_1 (Activation)    (None, 59, 31, 276)       0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 57, 29, 276)       2760      
_________________________________________________________________
batch_normalization_3 (Batch (None, 57, 29, 276)       1104      
_________________________________________________________________
activation_2 (Activation)    (None, 57, 29, 276)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 57, 29, 276)       76452     
_________________________________________________________________
batch_normalization_4 (Batch (None, 57, 29, 276)       1104      
_________________________________________________________________
activation_3 (Activation)    (None, 57, 29, 276)       0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 55, 27, 276)       2760      
_________________________________________________________________
batch_normalization_5 (Batch (None, 55, 27, 276)       1104      
_________________________________________________________________
activation_4 (Activation)    (None, 55, 27, 276)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 55, 27, 276)       76452     
_________________________________________________________________
batch_normalization_6 (Batch (None, 55, 27, 276)       1104      
_________________________________________________________________
activation_5 (Activation)    (None, 55, 27, 276)       0         
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 53, 25, 276)       2760      
_________________________________________________________________
batch_normalization_7 (Batch (None, 53, 25, 276)       1104      
_________________________________________________________________
activation_6 (Activation)    (None, 53, 25, 276)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 53, 25, 276)       76452     
_________________________________________________________________
batch_normalization_8 (Batch (None, 53, 25, 276)       1104      
_________________________________________________________________
activation_7 (Activation)    (None, 53, 25, 276)       0         
_________________________________________________________________
depthwise_conv2d_4 (Depthwis (None, 51, 23, 276)       2760      
_________________________________________________________________
batch_normalization_9 (Batch (None, 51, 23, 276)       1104      
_________________________________________________________________
activation_8 (Activation)    (None, 51, 23, 276)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 51, 23, 276)       76452     
_________________________________________________________________
batch_normalization_10 (Batc (None, 51, 23, 276)       1104      
_________________________________________________________________
activation_9 (Activation)    (None, 51, 23, 276)       0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 25, 11, 276)       0         
_________________________________________________________________
flatten (Flatten)            (None, 75900)             0         
_________________________________________________________________
dense (Dense)                (None, 10)                759010    
=================================================================
Total params: 1,178,530
Trainable params: 1,172,458
Non-trainable params: 6,072
_________________________________________________________________

Train loss:	0.016
Train accuracy:	0.995
Val loss:	0.258
Val accuracy:	0.951
Test loss:	0.228
Test accuracy:	0.955
Bias:		0.005
Variance:	0.044
Precision:	0.955
Recall:		0.955
F1:		0.955

Most 20 mispredicted words
16	no-go
15	up-off
12	no-down
10	on-off
9	up-on
9	yes-left
7	down-go
6	right-go
5	down-on
5	yes-go
4	down-stop
3	off-go
3	down-right
3	up-go
3	up-stop
3	no-left
3	yes-no
2	no-right
2	yes-down
1	off-stop
