Model: "DSConvModelSmall10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 120, 126, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 60, 63, 64)        2624      
_________________________________________________________________
batch_normalization (BatchNo (None, 60, 63, 64)        256       
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 58, 61, 64)        640       
_________________________________________________________________
batch_normalization_1 (Batch (None, 58, 61, 64)        256       
_________________________________________________________________
activation (Activation)      (None, 58, 61, 64)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 58, 61, 64)        4160      
_________________________________________________________________
batch_normalization_2 (Batch (None, 58, 61, 64)        256       
_________________________________________________________________
activation_1 (Activation)    (None, 58, 61, 64)        0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 56, 59, 64)        640       
_________________________________________________________________
batch_normalization_3 (Batch (None, 56, 59, 64)        256       
_________________________________________________________________
activation_2 (Activation)    (None, 56, 59, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 59, 64)        4160      
_________________________________________________________________
batch_normalization_4 (Batch (None, 56, 59, 64)        256       
_________________________________________________________________
activation_3 (Activation)    (None, 56, 59, 64)        0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 54, 57, 64)        640       
_________________________________________________________________
batch_normalization_5 (Batch (None, 54, 57, 64)        256       
_________________________________________________________________
activation_4 (Activation)    (None, 54, 57, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 54, 57, 64)        4160      
_________________________________________________________________
batch_normalization_6 (Batch (None, 54, 57, 64)        256       
_________________________________________________________________
activation_5 (Activation)    (None, 54, 57, 64)        0         
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 52, 55, 64)        640       
_________________________________________________________________
batch_normalization_7 (Batch (None, 52, 55, 64)        256       
_________________________________________________________________
activation_6 (Activation)    (None, 52, 55, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 52, 55, 64)        4160      
_________________________________________________________________
batch_normalization_8 (Batch (None, 52, 55, 64)        256       
_________________________________________________________________
activation_7 (Activation)    (None, 52, 55, 64)        0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 26, 27, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 44928)             0         
_________________________________________________________________
dense (Dense)                (None, 10)                449290    
=================================================================
Total params: 473,418
Trainable params: 472,266
Non-trainable params: 1,152
_________________________________________________________________

Train loss:	0.013
Train accuracy:	0.996
Val loss:	0.515
Val accuracy:	0.92
Test loss:	0.485
Test accuracy:	0.925
Bias:		0.004
Variance:	0.076
Precision:	0.925
Recall:		0.925
F1:		0.925

Most 20 mispredicted words
23	no-go
20	no-down
19	up-off
16	yes-left
15	down-go
13	down-on
12	on-off
10	up-go
10	up-on
9	up-stop
7	off-go
6	down-left
5	down-stop
5	no-off
4	on-go
4	right-stop
4	left-go
4	left-right
4	yes-no
3	left-stop
