Model: "DSConvModelSmall"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 80, 126, 1)]      0         
_________________________________________________________________
conv2d (Conv2D)              (None, 40, 63, 64)        2624      
_________________________________________________________________
batch_normalization (BatchNo (None, 40, 63, 64)        256       
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 38, 61, 64)        640       
_________________________________________________________________
batch_normalization_1 (Batch (None, 38, 61, 64)        256       
_________________________________________________________________
activation (Activation)      (None, 38, 61, 64)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 38, 61, 64)        4160      
_________________________________________________________________
batch_normalization_2 (Batch (None, 38, 61, 64)        256       
_________________________________________________________________
activation_1 (Activation)    (None, 38, 61, 64)        0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 36, 59, 64)        640       
_________________________________________________________________
batch_normalization_3 (Batch (None, 36, 59, 64)        256       
_________________________________________________________________
activation_2 (Activation)    (None, 36, 59, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 36, 59, 64)        4160      
_________________________________________________________________
batch_normalization_4 (Batch (None, 36, 59, 64)        256       
_________________________________________________________________
activation_3 (Activation)    (None, 36, 59, 64)        0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 34, 57, 64)        640       
_________________________________________________________________
batch_normalization_5 (Batch (None, 34, 57, 64)        256       
_________________________________________________________________
activation_4 (Activation)    (None, 34, 57, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 34, 57, 64)        4160      
_________________________________________________________________
batch_normalization_6 (Batch (None, 34, 57, 64)        256       
_________________________________________________________________
activation_5 (Activation)    (None, 34, 57, 64)        0         
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 32, 55, 64)        640       
_________________________________________________________________
batch_normalization_7 (Batch (None, 32, 55, 64)        256       
_________________________________________________________________
activation_6 (Activation)    (None, 32, 55, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 32, 55, 64)        4160      
_________________________________________________________________
batch_normalization_8 (Batch (None, 32, 55, 64)        256       
_________________________________________________________________
activation_7 (Activation)    (None, 32, 55, 64)        0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 16, 27, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 27648)             0         
_________________________________________________________________
dense (Dense)                (None, 10)                276490    
=================================================================
Total params: 300,618
Trainable params: 299,466
Non-trainable params: 1,152
_________________________________________________________________

Train loss:	0.01
Train accuracy:	0.996
Val loss:	1.195
Val accuracy:	0.858
Test loss:	0.411
Test accuracy:	0.925
Bias:		0.004
Variance:	0.138
Precision:	0.925
Recall:		0.925
F1:		0.925