Model: "AttRNNSpeechModel21"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 80, 126, 1)] 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 80, 126, 10)  260         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 80, 126, 10)  40          conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 80, 126, 1)   251         batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 80, 126, 1)   4           conv2d_1[0][0]                   
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 80, 126)      0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, 80, 128)      97792       squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 80, 128)      98816       bidirectional[0][0]              
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 128)          0           bidirectional_1[0][0]            
__________________________________________________________________________________________________
dense (Dense)                   (None, 128)          16512       lambda[0][0]                     
__________________________________________________________________________________________________
dot (Dot)                       (None, 80)           0           dense[0][0]                      
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
attSoftmax (Softmax)            (None, 80)           0           dot[0][0]                        
__________________________________________________________________________________________________
dot_1 (Dot)                     (None, 128)          0           attSoftmax[0][0]                 
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 64)           8256        dot_1[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 32)           2080        dense_1[0][0]                    
__________________________________________________________________________________________________
output (Dense)                  (None, 21)           693         dense_2[0][0]                    
==================================================================================================
Total params: 224,704
Trainable params: 224,682
Non-trainable params: 22
__________________________________________________________________________________________________

Train loss:	0.012
Train accuracy:	0.997
Val loss:	0.889
Val accuracy:	0.883
Test loss:	0.511
Test accuracy:	0.871
Bias:		0.003
Variance:	0.114
Precision:	0.871
Recall:		0.871
F1:		0.871

 Most 10 mispredicted words
95for-unknown
82three-unknown
72no-go
68no-unknown
62down-unknown
58one-unknown
49go-unknown
49left-unknown
42up-unknown
41eight-unknown
