Model: "DirectCNNBatchDropRegu"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 16000, 1)]        0         
_________________________________________________________________
conv1d (Conv1D)              (None, 7969, 16)          1040      
_________________________________________________________________
batch_normalization (BatchNo (None, 7969, 16)          64        
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 996, 16)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 483, 32)           16416     
_________________________________________________________________
batch_normalization_1 (Batch (None, 483, 32)           128       
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 60, 32)            0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 23, 64)            32832     
_________________________________________________________________
batch_normalization_2 (Batch (None, 23, 64)            256       
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 8, 128)            65664     
_________________________________________________________________
batch_normalization_3 (Batch (None, 8, 128)            512       
_________________________________________________________________
flatten (Flatten)            (None, 1024)              0         
_________________________________________________________________
dense (Dense)                (None, 128)               131200    
_________________________________________________________________
dropout (Dropout)            (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                8256      
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 10)                650       
=================================================================
Total params: 257,018
Trainable params: 256,538
Non-trainable params: 480
_________________________________________________________________

Train loss:	0.312
Train accuracy:	0.954
Val loss:	0.491
Val accuracy:	0.901
Test loss:	0.419
Test accuracy:	0.925
Bias:		0.046
Variance:	0.053
Precision:	0.925
Recall:		0.925
F1:		0.925