Model: "DSConvModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 40, 126, 1)]      0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 40, 63, 276)       11316     
_________________________________________________________________
batch_normalization_11 (Batc (None, 40, 63, 276)       1104      
_________________________________________________________________
depthwise_conv2d_5 (Depthwis (None, 19, 31, 276)       2760      
_________________________________________________________________
batch_normalization_12 (Batc (None, 19, 31, 276)       1104      
_________________________________________________________________
activation_10 (Activation)   (None, 19, 31, 276)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 19, 31, 276)       76452     
_________________________________________________________________
batch_normalization_13 (Batc (None, 19, 31, 276)       1104      
_________________________________________________________________
activation_11 (Activation)   (None, 19, 31, 276)       0         
_________________________________________________________________
depthwise_conv2d_6 (Depthwis (None, 17, 29, 276)       2760      
_________________________________________________________________
batch_normalization_14 (Batc (None, 17, 29, 276)       1104      
_________________________________________________________________
activation_12 (Activation)   (None, 17, 29, 276)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 17, 29, 276)       76452     
_________________________________________________________________
batch_normalization_15 (Batc (None, 17, 29, 276)       1104      
_________________________________________________________________
activation_13 (Activation)   (None, 17, 29, 276)       0         
_________________________________________________________________
depthwise_conv2d_7 (Depthwis (None, 15, 27, 276)       2760      
_________________________________________________________________
batch_normalization_16 (Batc (None, 15, 27, 276)       1104      
_________________________________________________________________
activation_14 (Activation)   (None, 15, 27, 276)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 15, 27, 276)       76452     
_________________________________________________________________
batch_normalization_17 (Batc (None, 15, 27, 276)       1104      
_________________________________________________________________
activation_15 (Activation)   (None, 15, 27, 276)       0         
_________________________________________________________________
depthwise_conv2d_8 (Depthwis (None, 13, 25, 276)       2760      
_________________________________________________________________
batch_normalization_18 (Batc (None, 13, 25, 276)       1104      
_________________________________________________________________
activation_16 (Activation)   (None, 13, 25, 276)       0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 13, 25, 276)       76452     
_________________________________________________________________
batch_normalization_19 (Batc (None, 13, 25, 276)       1104      
_________________________________________________________________
activation_17 (Activation)   (None, 13, 25, 276)       0         
_________________________________________________________________
depthwise_conv2d_9 (Depthwis (None, 11, 23, 276)       2760      
_________________________________________________________________
batch_normalization_20 (Batc (None, 11, 23, 276)       1104      
_________________________________________________________________
activation_18 (Activation)   (None, 11, 23, 276)       0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 11, 23, 276)       76452     
_________________________________________________________________
batch_normalization_21 (Batc (None, 11, 23, 276)       1104      
_________________________________________________________________
activation_19 (Activation)   (None, 11, 23, 276)       0         
_________________________________________________________________
average_pooling2d_1 (Average (None, 5, 11, 276)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 15180)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                151810    
=================================================================
Total params: 571,330
Trainable params: 565,258
Non-trainable params: 6,072
_________________________________________________________________

Train loss:	0.015
Train accuracy:	0.996
Val loss:	0.345
Val accuracy:	0.944
Test loss:	0.274
Test accuracy:	0.953
Bias:		0.004
Variance:	0.052
Precision:	0.953
Recall:		0.953
F1:		0.953