Model: "DSConvModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 40, 126, 1)]      0         
_________________________________________________________________
conv2d (Conv2D)              (None, 36, 122, 6)        156       
_________________________________________________________________
batch_normalization (BatchNo (None, 36, 122, 6)        24        
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 34, 120, 6)        60        
_________________________________________________________________
batch_normalization_1 (Batch (None, 34, 120, 6)        24        
_________________________________________________________________
activation (Activation)      (None, 34, 120, 6)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 34, 120, 6)        42        
_________________________________________________________________
batch_normalization_2 (Batch (None, 34, 120, 6)        24        
_________________________________________________________________
activation_1 (Activation)    (None, 34, 120, 6)        0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 17, 60, 6)         0         
_________________________________________________________________
flatten (Flatten)            (None, 6120)              0         
_________________________________________________________________
dense (Dense)                (None, 10)                61210     
=================================================================
Total params: 61,540
Trainable params: 61,504
Non-trainable params: 36
_________________________________________________________________

Train loss:	0.004
Train accuracy:	1.0
Val loss:	3.593
Val accuracy:	0.371
Test loss:	2.0
Test accuracy:	0.404
Bias:		0.0
Variance:	0.629
Precision:	0.404
Recall:		0.404
F1:		0.404