Model: "DSConvModelSmall21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 80, 126, 1)]      0         
_________________________________________________________________
conv2d (Conv2D)              (None, 40, 63, 64)        2624      
_________________________________________________________________
batch_normalization (BatchNo (None, 40, 63, 64)        256       
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 38, 61, 64)        640       
_________________________________________________________________
batch_normalization_1 (Batch (None, 38, 61, 64)        256       
_________________________________________________________________
activation (Activation)      (None, 38, 61, 64)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 38, 61, 64)        4160      
_________________________________________________________________
batch_normalization_2 (Batch (None, 38, 61, 64)        256       
_________________________________________________________________
activation_1 (Activation)    (None, 38, 61, 64)        0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 36, 59, 64)        640       
_________________________________________________________________
batch_normalization_3 (Batch (None, 36, 59, 64)        256       
_________________________________________________________________
activation_2 (Activation)    (None, 36, 59, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 36, 59, 64)        4160      
_________________________________________________________________
batch_normalization_4 (Batch (None, 36, 59, 64)        256       
_________________________________________________________________
activation_3 (Activation)    (None, 36, 59, 64)        0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 34, 57, 64)        640       
_________________________________________________________________
batch_normalization_5 (Batch (None, 34, 57, 64)        256       
_________________________________________________________________
activation_4 (Activation)    (None, 34, 57, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 34, 57, 64)        4160      
_________________________________________________________________
batch_normalization_6 (Batch (None, 34, 57, 64)        256       
_________________________________________________________________
activation_5 (Activation)    (None, 34, 57, 64)        0         
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 32, 55, 64)        640       
_________________________________________________________________
batch_normalization_7 (Batch (None, 32, 55, 64)        256       
_________________________________________________________________
activation_6 (Activation)    (None, 32, 55, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 32, 55, 64)        4160      
_________________________________________________________________
batch_normalization_8 (Batch (None, 32, 55, 64)        256       
_________________________________________________________________
activation_7 (Activation)    (None, 32, 55, 64)        0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 16, 27, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 27648)             0         
_________________________________________________________________
dense (Dense)                (None, 21)                580629    
=================================================================
Total params: 604,757
Trainable params: 603,605
Non-trainable params: 1,152
_________________________________________________________________

Train loss:	0.011
Train accuracy:	0.997
Val loss:	0.711
Val accuracy:	0.906
Test loss:	0.657
Test accuracy:	0.9
Bias:		0.003
Variance:	0.091
Precision:	0.9
Recall:		0.9
F1:		0.9

Most 20 mispredicted words
86	four-unknown
52	three-unknown
47	down-unknown
45	left-unknown
44	go-unknown
36	no-unknown
34	one-unknown
32	eight-unknown
31	five-unknown
31	up-off
29	zero-unknown
28	two-unknown
26	yes-unknown
25	nine-unknown
25	stop-unknown
23	seven-unknown
23	up-unknown
22	off-unknown
20	no-go
17	zero-two
