Model: "DSConvModel21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 80, 126, 1)]      0         
_________________________________________________________________
conv2d (Conv2D)              (None, 80, 63, 276)       11316     
_________________________________________________________________
batch_normalization (BatchNo (None, 80, 63, 276)       1104      
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 39, 31, 276)       2760      
_________________________________________________________________
batch_normalization_1 (Batch (None, 39, 31, 276)       1104      
_________________________________________________________________
activation (Activation)      (None, 39, 31, 276)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 39, 31, 276)       76452     
_________________________________________________________________
batch_normalization_2 (Batch (None, 39, 31, 276)       1104      
_________________________________________________________________
activation_1 (Activation)    (None, 39, 31, 276)       0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 37, 29, 276)       2760      
_________________________________________________________________
batch_normalization_3 (Batch (None, 37, 29, 276)       1104      
_________________________________________________________________
activation_2 (Activation)    (None, 37, 29, 276)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 37, 29, 276)       76452     
_________________________________________________________________
batch_normalization_4 (Batch (None, 37, 29, 276)       1104      
_________________________________________________________________
activation_3 (Activation)    (None, 37, 29, 276)       0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 35, 27, 276)       2760      
_________________________________________________________________
batch_normalization_5 (Batch (None, 35, 27, 276)       1104      
_________________________________________________________________
activation_4 (Activation)    (None, 35, 27, 276)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 35, 27, 276)       76452     
_________________________________________________________________
batch_normalization_6 (Batch (None, 35, 27, 276)       1104      
_________________________________________________________________
activation_5 (Activation)    (None, 35, 27, 276)       0         
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 33, 25, 276)       2760      
_________________________________________________________________
batch_normalization_7 (Batch (None, 33, 25, 276)       1104      
_________________________________________________________________
activation_6 (Activation)    (None, 33, 25, 276)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 33, 25, 276)       76452     
_________________________________________________________________
batch_normalization_8 (Batch (None, 33, 25, 276)       1104      
_________________________________________________________________
activation_7 (Activation)    (None, 33, 25, 276)       0         
_________________________________________________________________
depthwise_conv2d_4 (Depthwis (None, 31, 23, 276)       2760      
_________________________________________________________________
batch_normalization_9 (Batch (None, 31, 23, 276)       1104      
_________________________________________________________________
activation_8 (Activation)    (None, 31, 23, 276)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 31, 23, 276)       76452     
_________________________________________________________________
batch_normalization_10 (Batc (None, 31, 23, 276)       1104      
_________________________________________________________________
activation_9 (Activation)    (None, 31, 23, 276)       0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 15, 11, 276)       0         
_________________________________________________________________
flatten (Flatten)            (None, 45540)             0         
_________________________________________________________________
dense (Dense)                (None, 21)                956361    
=================================================================
Total params: 1,375,881
Trainable params: 1,369,809
Non-trainable params: 6,072
_________________________________________________________________

Train loss:	0.013
Train accuracy:	0.996
Val loss:	0.429
Val accuracy:	0.937
Test loss:	0.313
Test accuracy:	0.934
Bias:		0.004
Variance:	0.059
Precision:	0.934
Recall:		0.934
F1:		0.934

Most 20 mispredicted words
64	four-unknown
48	three-unknown
36	down-unknown
32	up-unknown
31	left-unknown
28	one-unknown
26	eight-unknown
26	no-unknown
25	two-unknown
24	five-unknown
22	zero-unknown
22	go-unknown
18	nine-unknown
14	up-off
13	seven-unknown
13	on-off
13	right-unknown
12	off-unknown
12	no-go
12	no-down
