Model: "DSConvModelMedium21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 40, 126, 1)]      0         
_________________________________________________________________
conv2d (Conv2D)              (None, 40, 63, 172)       7052      
_________________________________________________________________
batch_normalization (BatchNo (None, 40, 63, 172)       688       
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 19, 31, 172)       1720      
_________________________________________________________________
batch_normalization_1 (Batch (None, 19, 31, 172)       688       
_________________________________________________________________
activation (Activation)      (None, 19, 31, 172)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 19, 31, 172)       29756     
_________________________________________________________________
batch_normalization_2 (Batch (None, 19, 31, 172)       688       
_________________________________________________________________
activation_1 (Activation)    (None, 19, 31, 172)       0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 17, 29, 172)       1720      
_________________________________________________________________
batch_normalization_3 (Batch (None, 17, 29, 172)       688       
_________________________________________________________________
activation_2 (Activation)    (None, 17, 29, 172)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 17, 29, 172)       29756     
_________________________________________________________________
batch_normalization_4 (Batch (None, 17, 29, 172)       688       
_________________________________________________________________
activation_3 (Activation)    (None, 17, 29, 172)       0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 15, 27, 172)       1720      
_________________________________________________________________
batch_normalization_5 (Batch (None, 15, 27, 172)       688       
_________________________________________________________________
activation_4 (Activation)    (None, 15, 27, 172)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 15, 27, 172)       29756     
_________________________________________________________________
batch_normalization_6 (Batch (None, 15, 27, 172)       688       
_________________________________________________________________
activation_5 (Activation)    (None, 15, 27, 172)       0         
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 13, 25, 172)       1720      
_________________________________________________________________
batch_normalization_7 (Batch (None, 13, 25, 172)       688       
_________________________________________________________________
activation_6 (Activation)    (None, 13, 25, 172)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 13, 25, 172)       29756     
_________________________________________________________________
batch_normalization_8 (Batch (None, 13, 25, 172)       688       
_________________________________________________________________
activation_7 (Activation)    (None, 13, 25, 172)       0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 6, 12, 172)        0         
_________________________________________________________________
flatten (Flatten)            (None, 12384)             0         
_________________________________________________________________
dense (Dense)                (None, 21)                260085    
=================================================================
Total params: 399,233
Trainable params: 396,137
Non-trainable params: 3,096
_________________________________________________________________

Train loss:	0.006
Train accuracy:	0.998
Val loss:	0.598
Val accuracy:	0.936
Test loss:	0.606
Test accuracy:	0.922
Bias:		0.002
Variance:	0.063
Precision:	0.922
Recall:		0.922
F1:		0.922

Most 20 mispredicted words
69	three-unknown
66	for-unknown
39	no-unknown
37	down-unknown
30	one-unknown
29	go-unknown
26	left-unknown
25	up-unknown
24	eight-unknown
22	no-down
20	zero-unknown
20	no-go
19	up-off
18	two-unknown
18	off-unknown
16	right-unknown
15	on-off
15	no-nine
14	five-unknown
14	down-go
