Model: "DirectCNN"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         [(None, 16000, 1)]        0         
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 7969, 16)          1040      
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 996, 16)           0         
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 483, 32)           16416     
_________________________________________________________________
max_pooling1d_5 (MaxPooling1 (None, 60, 32)            0         
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 23, 64)            32832     
_________________________________________________________________
conv1d_11 (Conv1D)           (None, 8, 128)            65664     
_________________________________________________________________
flatten_2 (Flatten)          (None, 1024)              0         
_________________________________________________________________
dense_6 (Dense)              (None, 128)               131200    
_________________________________________________________________
dense_7 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_8 (Dense)              (None, 10)                650       
=================================================================
Total params: 256,058
Trainable params: 256,058
Non-trainable params: 0
_________________________________________________________________

Train loss:	0.032
Train accuracy:	0.99
Val loss:	0.688
Val accuracy:	0.901
Test loss:	0.496
Test accuracy:	0.914
Bias:		0.01
Variance:	0.089
Precision:	0.914
Recall:		0.914
F1:		0.914